# 1 Concat()

## 1.1 Concatenate vertically

In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({id:['A','B','C','D'],
                 'age':[30,23,25,22]})

df2=pd.DataFrame({id:['E','F','G','H'],
                 'age':[40,21,19,24]})

In [3]:
pd.concat([df1,df2],axis=0,ignore_index=True)

  <built-in function id>  age
0                      A   30
1                      B   23
2                      C   25
3                      D   22
4                      E   40
5                      F   21
6                      G   19
7                      H   24

In [17]:
df_movies=pd.read_csv('IMDb movies.csv',low_memory=False)
df_ratings=pd.read_csv("IMDb ratings.csv",low_memory=False)

In [18]:
# select columns
df_movies=df_movies[['imdb_title_id', 'title', 'year','genre','country']]
df_ratings=df_ratings[['imdb_title_id','total_votes','mean_vote']]
df_movies

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

### 1.1.1 Exercise

In [6]:
# extract a 50% sample of the original dataframe(df_movies)
df_sample=df_movies.sample(frac=0.5)

In [7]:
# shape of dataframes that we'll concatenate
df_sample.shape

(42928, 5)

In [8]:
# concatenate and df_movies and df_sample(vertically along the rows)
df_concat_vert=pd.concat([df_movies,df_sample],axis=0)

In [19]:
# shape
df_concat_vert.shape
df_concat_vert

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
62023,tt1793224,Friends: Mononokeshima no Naki,2011,"Animation, Adventure, Comedy",Japan
52614,tt10244754,Lillian,2019,Drama,Austria
55411,tt1206485,Nuit de chien,2008,Drama,"Portugal, Germany, France"
34387,tt0171444,Kozure satsujin ken,1976,"Action, Crime, Drama",Japan
58075,tt1434423,Feng sheng,2009,"Crime, Drama, Thriller",China

## 1.2 Concatenate horizontally

In [10]:
df1=pd.DataFrame({id:['A','B','C','D'],
                 'age':[30,23,25,22]})

df2=pd.DataFrame({'job':['Doctor','Statistician ','Accountant','Developer']})

In [11]:
pd.concat([df1,df2],axis=1)

  <built-in function id>  age            job
0                      A   30         Doctor
1                      B   23  Statistician
2                      C   25     Accountant
3                      D   22      Developer

### 1.2.1 Excercise

In [12]:
# shape of dataframes that we'll concatenate
print(df_movies.shape)
print(df_ratings.shape)

(85855, 5)
(85855, 3)

In [13]:
df_movies.set_index('imdb_title_id',inplace=True)

In [14]:
df_ratings.set_index('imdb_title_id',inplace=True)

In [15]:
# concatenate df_movies and df_ratings on 'imdb_title_id' (horizontally)
df_concat_hori=pd.concat([df_movies,df_ratings],axis=1,)

In [16]:
# shape
df_concat_hori.shape

(85855, 6)